Integration/13. Outbound Integration from Fusion SaaS using REST Connection/artefacts/SOAP Endpoint/SOAP_Request_Message.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v01="http://abc.com/ws/myservices/sample/V01">
   <soapenv:Header/>
   <soapenv:Body>
      <v01:ReceiptReqParam>
         <!--Optional:-->
         <v01:ReceiptNumber>RCPT_4m_REST1001</v01:ReceiptNumber>
      </v01:ReceiptReqParam>
   </soapenv:Body>
</soapenv:Envelope>